# update install location
cask_args appdir: '/Applications'

# shell stuff
brew 'zsh'
brew 'tmux'
brew 'exa'
brew 'jq'
brew 'fzf'
brew 'ripgrep'
brew 'starship'
brew 'gh'

# utilities
brew 'nvm'
brew 'neovim'
brew 'awscli'
brew 'fastlane'
brew 'pre-commit'
# brew 'postgresql'
# brew 'teleport'

# python
brew 'pyenv'
brew 'poetry'
# brew 'flake8'

# apps
cask 'iterm2'
cask 'spectacle'
cask 'google-chrome'
cask '1password'
cask 'slack'
cask 'docker'

# ---- extra stuff ----

cask 'flutter'
cask 'visual-studio-code'
cask 'android-studio'
cask 'ngrok'

# cask 'divvy'
# cask 'deluge'
# cask 'java8'
# cask 'intellij-idea'
# cask 'pycharm'
# brew 'gradle'
