# update install location
cask_args appdir: '/Applications'

# shell stuff
brew 'zsh'
brew 'tmux'
brew 'exa'
brew 'jq'
brew 'fzf'
brew 'ripgrep'

# utilities
brew 'nvm'
brew 'neovim'
brew 'awscli'
brew 'postgresql'
# brew 'teleport'

# python
brew 'pyenv'
brew 'flake8'
brew 'poetry'
# brew 'pyenv-virtualenv'

# apps
cask 'iterm2'
cask 'spectacle'
cask 'google-chrome'
cask '1password'
cask 'slack'

# cask 'docker'
# cask 'divvy'
# cask 'deluge'
# cask 'java8'
# cask 'intellij-idea'
# cask 'pycharm'
# brew 'gradle'
