cask_args appdir: '/Applications'
tap 'caskroom/cask'

brew 'zsh'
brew 'vim'
brew 'macvim'
brew 'awscli'
brew 'pyenv'
brew 'ripgrep'
brew 'fzf'

cask 'java'
cask 'google-chrome'
cask 'iterm2'
cask 'dropbox'
cask 'slack'
cask '1password'
cask 'istat-menus'
cask 'witch'
cask 'divvy'

# cask 'vlc'
# cask 'dash'
